<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 13 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 13: Компьютерные сети и адресация в Интернете</h2>
    <p><strong>Тема:</strong> Компьютерные сети. Адресация в Интернете.</p>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Адрес документа в Интернете (URL) состоит из протокола, доменного имени, каталога и имени файла.</li>
      <li>Каждый компьютер в Интернете имеет собственный адрес (IP-адрес), который является 32-битным числом.</li>
      <li>IP-адрес состоит из адреса сети и адреса узла, определяемых с помощью маски сети.</li>
      <li>Для задач на IP-адреса можно использовать модуль <code>ipaddress</code> в Python.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Для узла с IP-адресом 15.51.208.15 адрес сети равен 15.51.192.0. Найдите наименьшее возможное количество единиц в двоичной записи маски подсети.</p>
    <p><strong>Решение:</strong></p>
    <pre><code>
from ipaddress import *
for i in range(32): 
    net = ip_network("15.51.208.15/" + str(i))
    sub = str(net).split("/")
    if sub[0] == "15.51.192.0": # нужная сеть
        print(net.prefixlen)
        break
    </code></pre>
    <p>Ответ: 18.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
