<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 14 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 14: Позиционные системы счисления</h2>
    <p><strong>Тема:</strong> Позиционные системы счисления.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Знание позиционных систем счисления.</li>
      <li>Умение строить информационные модели объектов, систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Принципы кодирования чисел в позиционных системах счисления.</li>
      <li>Правила перевода чисел из одной системы счисления в другую.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Операнды арифметического выражения записаны в системе счисления с основанием 15: 123x515 + 1x23315. В записи чисел переменной x обозначена неизвестная цифра из алфавита 15-ричной системы счисления. Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 14. Для найденного значения x вычислите частное от деления значения арифметического выражения на 14 и укажите его в ответе в десятичной системе счисления.</p>
    <p><strong>Решение:</strong></p>
    <pre><code>from ipaddress import *
for x in '0123456789ABCDE':
  a = int('123'+x+'5', 15) + int('1'+x+'233', 15)
  if a % 14 == 0:
    print('x =', x, 'Ответ:', a // 14)
    break</code></pre>
    <p>Ответ: 8767.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
