<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 15 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 15: Основные понятия математической логики</h2>
    <p><strong>Тема:</strong> Основные понятия математической логики.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Знание основных понятий и законов математической логики.</li>
      <li>Умение вычислять логическое значение сложного высказывания по известным значениям элементарных высказываний.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Условные обозначения логических операций: отрицание (¬), логическое умножение (конъюнкция), логическое сложение (дизъюнкция), импликация (следование).</li>
      <li>Таблицы истинности логических операций "И", "ИЛИ", "НЕ", "импликация".</li>
      <li>Правила выполнения логических операций.</li>
      <li>Формулы де Моргана для упрощения логических выражений.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Укажите наибольшее целое значение A, при котором выражение ¬ДЕЛ(x,A) → (¬ДЕЛ(x,21) ∧ ¬ДЕЛ(x,35)) тождественно истинно (принимает значение 1) при любом натуральном значении переменной x.</p>
    <p><strong>Решение:</strong></p>
    <pre><code>
def Del(x, D):
    return x % D == 0

def f(x, A):
    return (not Del(x, A)) <= (Del(x, 21) <= (not Del(x, 35)))

for A in range(1, 1000):
    OK = True
    for x in range(1, 1000):
        if not f(x, A):
            OK = False
            break
    if OK:
        print(A)
        break
    </code></pre>
    <p>Ответ: 7.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
