<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 16 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 16: Рекурсия. Рекурсивные процедуры и функции</h2>
    <p><strong>Тема:</strong> Рекурсия. Рекурсивные процедуры и функции.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Вычисление рекуррентных выражений.</li>
      <li>Индуктивное определение объектов.</li>
      <li>Умение строить информационные модели объектов систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Для задания рекурсивной функции необходимо определить условие окончания рекурсии и рекуррентную формулу.</li>
      <li>Решение задач с рекурсией можно выполнять вручную, используя электронные таблицы или собственные программы.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Алгоритм вычисления функции F(n) задан следующими соотношениями:</p>
    <ul>
      <li>F(n) = 2n при n ≤ 5</li>
      <li>F(n) = F(n–2) + 3(F(n/2) + n) если n > 5 и n чётно</li>
      <li>F(n) = F(n–1) + F(n–2) + F(n–3) если n > 5 и n нечётно</li>
    </ul>
    <p>Чему равно значение функции F(99) + F(100)?</p>
    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
def F(n):
  if n <= 5:
    return 2*n
  if n % 2 == 0:
    return F(n-2) + 3*F(n//2) + n
  else:
    return F(n-1) + F(n-2) + F(n-3)

print(F(99) + F(100))
    </code></pre>
    <p>Ответ: 142139494.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
