<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 17 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</а></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 17: Перебор последовательности целых чисел. Проверка делимости</h2>
    <p><strong>Тема:</strong> Перебор последовательности целых чисел. Проверка делимости.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение создавать собственные программы для обработки целочисленной информации.</li>
      <li>Основные конструкции языка программирования.</li>
      <li>Умение создавать программы на языке программирования по их описанию.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Перебор всех целых чисел на отрезке и подсчет количества чисел, удовлетворяющих определенному условию.</li>
      <li>Проверка делимости числа на другое число.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Рассматривается множество целых чисел, принадлежащих числовому отрезку [1016; 7937], которые делятся на 3 и не делятся на 7, 17, 19, 27. Найдите количество таких чисел и максимальное из них. В ответе запишите два целых числа: сначала количество, затем максимальное число.</p>
    <p><strong>Решение:</strong></p>
    <pre><code>
count = 0
maxGood = 0
for n in range(1016, 7938):
    if (n % 3 == 0) and (n % 7 != 0) and (n % 17 != 0) and (n % 19 != 0) and (n % 27 != 0):
        maxGood = n 
        count += 1
print(count, maxGood)
    </code></pre>
    <p>Ответ: 1568, 7935.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
