<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 22 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 22: Многопроцессорные системы</h2>
    <p><strong>Тема:</strong> Построение математических моделей для решения практических задач. Архитектура современных компьютеров. Многопроцессорные системы.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение анализировать алгоритм, содержащий ветвление и цикл.</li>
      <li>Программная и аппаратная организация компьютеров и компьютерных систем.</li>
      <li>Оценка скорости передачи и обработки информации.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Процессы в современных компьютерах могут выполняться параллельно, если являются независимыми.</li>
      <li>Выражение «процесс В зависит от процесса А» означает, что выполнение процесса В не может начаться раньше, чем выполнение процесса А.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>В файле <em>22-2024.xls</em> содержится информация о совокупности N вычислительных процессов, которые могут выполняться параллельно или последовательно. Процесс B зависит от процесса A, если для выполнения процесса B необходимы результаты выполнения процесса A. Определите максимальную продолжительность отрезка времени (в мс), в течение которого возможно одновременное выполнение четырёх процессов при условии, что все независимые друг от друга процессы могут выполняться параллельно.</p>
    <p><strong>Решение (электронные таблицы):</strong></p>
    <p>Используя таблицу в файле, построим диаграмму Ганта, определим длительность процесса и контроль длительности.</p>
    <pre><code>
# Пример на Python
def calculate_parallel_duration(processes):
    max_duration = 0
    for process in processes:
        # вычисляем параллельную длительность для каждого процесса
        duration = process['end'] - process['start']
        if duration > max_duration:
            max_duration = duration
    return max_duration

processes = [{'id': 1, 'start': 0, 'end': 4},
             {'id': 2, 'start': 0, 'end': 3},
             {'id': 3, 'start': 4, 'end': 5},
             {'id': 4, 'start': 5, 'end': 12}]
max_duration = calculate_parallel_duration(processes)
print("Максимальная продолжительность параллельного выполнения:", max_duration)
    </code></pre>
    <p>Ответ: 7.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
