<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 23 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 23: Динамическое программирование</h2>
    <p><strong>Тема:</strong> Динамическое программирование.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение анализировать результат исполнения алгоритма.</li>
      <li>Умение строить информационные модели объектов систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Динамическое программирование – способ решения сложных задач путем сведения их к более простым задачам того же типа.</li>
      <li>С помощью динамического программирования решаются задачи, которые требуют полного перебора вариантов:</li>
      <ul>
        <li>«подсчитайте количество вариантов…»</li>
        <li>«как оптимально распределить…»</li>
        <li>«найдите оптимальный маршрут…»</li>
      </ul>
      <li>Динамическое программирование позволяет ускорить выполнение программы за счет использования дополнительной памяти; полный перебор не требуется, поскольку запоминаются решения всех задач с меньшими значениями параметров.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Исполнитель преобразует число на экране. У исполнителя есть две команды, которым присвоены номера:</p>
    <ul>
      <li>1. Прибавить 1</li>
      <li>2. Умножить на 2</li>
    </ul>
    <p>Программа для исполнителя – это последовательность команд. Сколько существует программ, для которых при исходном числе 1 результатом является число 20 и при этом траектория вычислений содержит число 10?</p>
    <p><strong>Решение (теоретическое):</strong></p>
    <p>Запишем рекуррентную формулу для вычисления количества возможных программ для получения числа N из некоторого начального числа:</p>
    <ul>
      <li>Если N не делится на 2: K(N) = K(N-1)</li>
      <li>Если N делится на 2: K(N) = K(N-1) + K(N/2)</li>
    </ul>
    <p>В данном случае траектория проходит через число 10, следовательно:</p>
    <pre><code>
N:  1  2  3  4  5  6  7  8  9  10
KN: 1  1  2  2  3  3  5  5  7  7
    </code></pre>
    <p>Далее продолжаем расчет для чисел от 10 до 20:</p>
    <pre><code>
N:  10  11  12  13  14  15  16  17  18  19  20
KN:  7   7   9   9  12  12  15  15  19  19  28
    </code></pre>
    <p>Ответ: 28.</p>
    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
def numProg(start, end):
    if start == end:
        return 1
    if start > end:
        return 0
    return numProg(start + 1, end) + numProg(start * 2, end)

result = numProg(1, 10) * numProg(10, 20)
print(result)  # Ответ: 28
    </code></pre>
  </section>

  <script src="script.js"></script>

</body>
</html>
