<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 24 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 24: Обработка символьных строк</h2>
    <p><strong>Тема:</strong> Обработка символьных строк.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение создавать собственные программы для обработки символьной информации.</li>
      <li>Умение строить информационные модели объектов систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Основы работы с текстовыми файлами в различных языках программирования.</li>
      <li>Принципы поиска и обработки символов в строках.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Текстовый файл <em>24.txt</em> состоит не более чем из 10^6 символов X, Y и Z. Определите максимальное количество идущих подряд символов, среди которых каждые два соседних различны. Для выполнения этого задания следует написать программу.</p>
    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
with open("24.txt", "r") as F:
    s = F.readline()

maxLen = curLen = 1
for i in range(1, len(s)):
    if s[i] != s[i-1]:
        curLen += 1
        if curLen > maxLen:
            maxLen = curLen
    else:
        curLen = 1

print(maxLen)
    </code></pre>
    <p>Ответ: 35 (примерное значение, зависит от содержимого файла).</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
