<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 25 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 25: Обработка целых чисел. Проверка делимости</h2>
    <p><strong>Тема:</strong> Обработка целых чисел. Проверка делимости.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение создавать собственные программы (10–20 строк) для обработки целочисленной информации.</li>
      <li>Умение строить информационные модели объектов систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Перебор целых чисел на отрезке и проверка делимости.</li>
      <li>Определение количества делителей числа.</li>
      <li>Проверка простоты числа.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:</p>
    <ul>
      <li>«?» означает ровно одну произвольную цифру;</li>
      <li>«*» означает любую последовательность цифр произвольной длины, в том числе и пустую последовательность.</li>
    </ul>
    <p>Среди натуральных чисел, не превышающих 10<sup>10</sup>, найдите все числа, соответствующие маске 1?2139*4, делящиеся на 2023 без остатка. В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце – соответствующие им результаты деления этих чисел на 2023.</p>
    
    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
s = []
list_c2 = [""] + list(str(n) for n in range(1000)) + \
            list("0" + str(n) for n in range(100)) + \
            list("00" + str(n) for n in range(10))
for x in "0123456789":
  for y in list_c2:
    n = int(f"1{x}2139{y}4")
    if n % 2023 == 0:
       s.append(n)
s.sort()
for n in s:
  print(n, n // 2023)
    </code></pre>

    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
for i in range(1021394 // 2023 + 1, 1921399994 // 2023 + 1):
  num = str(2023 * i)
  if num[0] == '1' and num[-1] == '4' and num[2:6] == '2139':
    print(num, i)
    </code></pre>

    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
from itertools import product
for a in '0123456789':
  for L in range(0, 3+1):
    for i in product('0123456789', repeat=L):
      b = ''.join(i)
      x = int('1' + a + '2139' + b + '4')
      if x % 2023 == 0:
        print(x, x // 2023)
    </code></pre>
    <p>Ответ: 162139404, 1321399324, 1421396214, 1521393104</p>
  </section>
  <script src="user.js"></script>
  <script src="script.js"></script>

</body>
</html>
