<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 26 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 26: Обработка массива целых чисел из файла. Сортировка.</h2>
    <p><strong>Тема:</strong> Обработка массива целых чисел из файла. Сортировка.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение обрабатывать целочисленную информацию с использованием сортировки.</li>
      <li>Построение алгоритмов и практические вычисления.</li>
      <li>Строить информационные модели объектов систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать при написании программы:</strong></p>
    <ul>
      <li>Чтение данных из файла.</li>
      <li>Хранение массива данных.</li>
      <li>Сортировка массива.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Системный администратор раз в неделю создаёт архив пользовательских файлов. Однако объём диска, куда он помещает архив, может быть меньше, чем суммарный объём архивируемых файлов. Известно, какой объём занимает файл каждого пользователя. По заданной информации об объёме файлов пользователей и свободном объёме на архивном диске определите максимальное число пользователей, чьи файлы можно сохранить в архиве, а также максимальный размер имеющегося файла, который может быть сохранён в архиве при условии, что сохранены файлы максимально возможного числа пользователей.</p>
    <p><strong>Входные данные:</strong></p>
    <pre><code>100 4
80
30
50
40
    </code></pre>
    <p>При таких исходных данных можно сохранить файлы максимум двух пользователей. Возможные объёмы этих двух файлов: 30 и 40, 30 и 50, или 40 и 50. Наибольший объём файла из перечисленных пар – 50, поэтому ответ для приведённого примера: 2 50.</p>
    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
def read_data(filename):
    with open(filename) as f:
        S, N = map(int, f.readline().split())
        data = sorted([int(f.readline()) for _ in range(N)])
    return S, data

def max_files(S, data):
    total = 0
    count = 0
    for size in data:
        if total + size > S:
            break
        total += size
        count += 1
    return count, total

def max_file_size(S, data, count, total):
    delta = S - total
    max_candidate = 0
    for size in data[count:]:
        if size - data[count-1] <= delta:
            max_candidate = max(max_candidate, size)
    return max_candidate

S, data = read_data("26.txt")
count, total = max_files(S, data)
max_candidate = max_file_size(S, data, count, total)
print(count, max_candidate)
    </code></pre>
    <p>Ответ: 2 50.</p>
  </section>
  <script src="user.js"></script>
  <script src="script.js"></script>

</body>
</html>
