<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 27 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 27: Обработка данных вводимых из файла в виде последовательности чисел</h2>
    <p><strong>Тема:</strong> Обработка данных вводимых из файла в виде последовательности чисел.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Умение создавать собственные программы (20–40 строк) для анализа числовых последовательностей.</li>
      <li>Построение алгоритмов и практические вычисления.</li>
      <li>Строить информационные модели объектов систем и процессов в виде алгоритмов.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>Как прочитать данные из файла.</li>
      <li>Основы комбинаторики.</li>
      <li>Динамическое программирование.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Дана последовательность из N натуральных чисел. Рассматриваются все её непрерывные подпоследовательности, такие что сумма элементов каждой из них кратна k = 43. Найдите среди них подпоследовательность с максимальной суммой, определите её длину. Если таких подпоследовательностей найдено несколько, в ответе укажите количество элементов самой короткой из них.</p>
    <p><strong>Входные данные:</strong></p>
    <pre><code>7
21
13
9
19
17
26
95
    </code></pre>
    <p>В этом наборе можно выбрать последовательности 21+13+9 (сумма 43) и 17+26 (сумма 43). Самая короткая из них 17 + 26 имеет длину 2. Для указанных данных программа должна вывести число 2.</p>
    <p><strong>Решение (программа на Python):</strong></p>
    <pre><code>
F = open("27.txt")
N = int(F.readline())
K = 43
tailSum = [0] + [None] * (K - 1)
tailLen = [0] * K
maxSum, minLen = 0, 0
totalSum = 0

for i in range(1, N + 1):
    x = int(F.readline())
    totalSum += x
    r = totalSum % K
    if tailSum[r] is not None:
        curSum = totalSum - tailSum[r]
        curLen = i - tailLen[r]
        if curSum > maxSum or (curSum == maxSum and curLen < minLen):
            maxSum = curSum
            minLen = curLen
    else:
        tailSum[r] = totalSum
        tailLen[r] = i

F.close()
print(minLen)
    </code></pre>
  </section>
  
  <script src="user.js"></script>
  <script src="script.js"></script>

</body>
</html>
