<!DOCTYPE html>
<html lang="ru" dir="ltr">
<head>
    <meta charset="UTF-8">
    <title>Задание 8 | ЕГЭ по информатике</title>
    <link rel="stylesheet" href="style.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
</head>
<body>
  <nav>
    <div class="navbar">
      <div class="logo"><a href="#">ЕГЭ по информатике</a></div>
      <ul class="nav-links">
        <li><a href="index.html">Главная</a></li>
        <li><a href="contact.html">Обратная связь</a></li>
        <li><a href="topics.html">Темы</a></li>
        <li><a href="practice.html">Практика</a></li>
        <li><a href="literature.html">Литература</a></li>
      </ul>
      <div class="appearance">
        <div class="light-dark">
          <i class="btn fas fa-moon" data-color="#e4e6eb #e4e6eb #24292D #24292D #242526"></i>
        </div>
        <div class="color-icon">
          <div class="icons">
            <i class="fas fa-palette"></i>
            <i class="fas fa-sort-down arrow"></i>
          </div>
          <div class="color-box">
            <h3>Color Switcher</h3>
            <div class="color-switchers">
              <button class="btn blue active" data-color="#fff #24292d #4070f4 #0b3cc1 #F0F8FF"></button>
              <button class="btn orange" data-color="#fff #242526 #F79F1F #DD8808 #fef5e6"></button>
              <button class="btn purple" data-color="#fff #242526 #8e44ad #783993 #eadaf1"></button>
              <button class="btn green" data-color="#fff #242526 #3A9943 #2A6F31 #DAF1DC"></button>
            </div>
          </div>
        </div>
      </div>
    </div>
  </nav>

  <section class="explanation-content">
    <h2 class="text">Задание 8: Комбинаторика и системы счисления</h2>
    <p><strong>Тема:</strong> Кодирование данных, комбинаторика, системы счисления.</p>
    <p><strong>Что проверяется:</strong></p>
    <ul>
      <li>Знание методов измерения количества информации.</li>
      <li>Формализация понятия алгоритма.</li>
      <li>Чтение и отладка программ на языке программирования.</li>
    </ul>
    <p><strong>Что нужно знать:</strong></p>
    <ul>
      <li>В русском языке 33 буквы: 10 гласных и 21 согласная.</li>
      <li>Алфавит английского языка состоит из 26 букв.</li>
      <li>Принципы работы с числами, записанными в позиционных системах счисления.</li>
      <li>Формулы для расчета количества возможных слов.</li>
      <li>Использование функций из модуля itertools в Python: combinations, permutations, product.</li>
    </ul>
    <p><strong>Пример задания:</strong></p>
    <p>Игорь составляет таблицу кодовых слов для передачи сообщений. В качестве кодовых слов он использует трёхбуквенные слова, в которых могут быть только буквы Ш, К, О, Л, А, причем буква К появляется ровно 1 раз. Сколько различных кодовых слов может использовать Игорь?</p>
    <p><strong>Решение (теоретическое):</strong></p>
    <p>Буква К может стоять на одном из трёх мест, остальные две буквы выбираются из оставшихся четырех букв: Ш, О, Л, А. Для каждой позиции буквы К существует 4^2 = 16 вариантов выбора остальных букв. Общее количество подходящих слов: 3 * 16 = 48.</p>
    <p>Ответ: 48.</p>
    <p><strong>Решение (с помощью программы):</strong></p>
    <pre><code>
from itertools import product

def valid(word):
    return word.count('К') == 1

count = 0
for word in product('ШКОЛА', repeat=3):
    if valid(''.join(word)):
        count += 1
print(count)
    </code></pre>
    <p>Ответ: 48.</p>
  </section>

  <script src="script.js"></script>

</body>
</html>
